# Import Library

In [1]:
import pandas as pd

# Getting Started

The primary two components of pandas are the Series and DataFrame.

A Series is essentially a column, and a DataFrame is a multi-dimensional table made up of a collection of Series.

![alt text](https://storage.googleapis.com/lds-media/images/series-and-dataframe.width-1200.png "Title")

---

# 1. What is a Series?

A Pandas Series is like a column in a table.

It is a one-dimensional array holding data of any type.

In [2]:
a = [1, 7, 2]

myvar = pd.Series(a)

print(myvar)

0    1
1    7
2    2
dtype: int64

In [3]:
type(myvar)

pandas.core.series.Series

## 1.1. Labels

If nothing else is specified, the values are labeled with their index number. First value has index 0, second value has index 1 etc.

This label can be used to access a specified value.

In [4]:
print(myvar[1])

7

## 1.2. Create Labels

With the index argument, you can name your own labels.

In [5]:
a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"])

print(myvar)

x    1
y    7
z    2
dtype: int64

In [6]:
print(myvar["y"])

7

## 1.3. Key/Value Objects as Series

You can also use a key/value object, like a dictionary, when creating a Series.

In [7]:
calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories)

print(myvar)

day1    420
day2    380
day3    390
dtype: int64

---

# 2. What is a DataFrame?

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [8]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [9]:
df

   calories  duration
0       420        50
1       380        40
2       390        45

## 2.1. Locate Row

As you can see from the result above, the DataFrame is like a table with rows and columns.

Pandas use the **loc** attribute to return one or more specified row(s)

In [90]:
# Return row 0:

print(df.loc[0])

calories    420
duration     50
Name: 0, dtype: int64

In [91]:
#use a list of indexes:
print(df.loc[[0, 2]])

   calories  duration
0       420        50
2       390        45

## 2.2. Named Indexes

With the **index** argument, you can name your own indexes.

In [92]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [93]:
df

      calories  duration
day1       420        50
day2       380        40
day3       390        45

## 2.3. Locate Named Indexes

Use the named index in the **loc** attribute to return the specified row(s).

In [94]:
#refer to the named index:
print(df.loc["day2"])

calories    380
duration     40
Name: day2, dtype: int64

In [95]:
#refer to the named index:
print(df.iloc[1])

calories    380
duration     40
Name: day2, dtype: int64

---

# 3. Load Files Into a DataFrame

If your data sets are stored in a file, Pandas can load them into a DataFrame.

## 3.1. Read CSV

A simple way to store big data sets is to use CSV files (comma separated files).

CSV files contains plain text and is a well know format that can be read by everyone including Pandas.

In [10]:
df = pd.read_csv('data.csv')

print(df)

     Duration  Pulse  Maxpulse  Calories     Time
0          60    110       130     409.1  Morning
1          60    117       145     479.0  Morning
2          60    103       135     340.0  Morning
3          45    109       175     282.4  Morning
4          45    117       148     406.0  Morning
..        ...    ...       ...       ...      ...
164        60    105       140     290.8  Morning
165        60    110       145     300.0  Morning
166        60    115       145     310.2  Morning
167        75    120       150     320.4  Morning
168        75    125       150     330.4  Morning

[169 rows x 5 columns]

**Tip:** use to_string() to print the entire DataFrame.

In [97]:
print(df.to_string())

     Duration  Pulse  Maxpulse  Calories     Time
0          60    110       130     409.1  Morning
1          60    117       145     479.0  Morning
2          60    103       135     340.0  Morning
3          45    109       175     282.4  Morning
4          45    117       148     406.0  Morning
5          60    102       127     300.0  Morning
6          60    110       136     374.0  Evening
7          45    104       134     253.3  Morning
8          30    109       133     195.1  Morning
9          60     98       124     269.0  Morning
10         60    103       147     329.3  Morning
11         60    100       120     250.7  Morning
12         60    106       128     345.3  Morning
13         60    104       132     379.3  Morning
14         60     98       123     275.0  Morning
15         60     98       120     215.2  Morning
16         60    100       120     300.0  Morning
17         45     90       112       NaN  Morning
18         60    103       123     323.0  Morning
19         45     97       125     243.0  Evening
20         60    108       131     364.2  Morning
21         45    100       119     282.0  Morning
22         60    130       101     300.0  Morning
23         45    105       132     246.0  Morning
24         60    102       126     334.5  Morning
25         60    100       120     250.0  Morning
26         60     92       118     241.0  Morning
27         60    103       132       NaN  Morning
28         60    100       132     280.0  Morning
29         60    102       129     380.3  Morning
30         60     92       115     243.0  Morning
31         45     90       112     180.1  Morning
32         60    101       124     299.0  Morning
33         60     93       113     223.0  Morning
34         60    107       136     361.0  Morning
35         60    114       140     415.0  Morning
36         60    102       127     300.0  Morning
37         60    100       120     300.0  Morning
38         60    100       120     300.0  Evening
39         45    104       129     266.0  Morning
40         45     90       112     180.1  Morning
41         60     98       126     286.0  Morning
42         60    100       122     329.4  Morning
43         60    111       138     400.0  Morning
44         60    111       131     397.0  Morning
45         60     99       119     273.0  Morning
46         60    109       153     387.6  Morning
47         45    111       136     300.0  Evening
48         45    108       129     298.0  Morning
49         60    111       139     397.6  Morning
50         60    107       136     380.2  Morning
51         80    123       146     643.1  Morning
52         60    106       130     263.0  Morning
53         60    118       151     486.0  Morning
54         30    136       175     238.0  Evening
55         60    121       146     450.7  Morning
56         60    118       121     413.0  Morning
57         45    115       144     305.0  Morning
58         20    153       172     226.4  Morning
59         45    123       152     321.0  Morning
60        210    108       160    1376.0  Morning
61        160    110       137    1034.4  Morning
62        160    109       135     853.0  Morning
63         45    118       141     341.0  Morning
64         20    110       130     131.4  Morning
65        180     90       130     800.4  Morning
66        150    105       135     873.4  Morning
67        150    107       130     816.0  Morning
68         20    106       136     110.4  Morning
69        300    108       143    1500.2  Morning
70        150     97       129    1115.0  Evening
71         60    109       153     387.6  Morning
72         90    100       127     700.0  Morning
73        150     97       127     953.2  Morning
74         45    114       146     304.0  Morning
75         90     98       125     563.2  Morning
76         45    105       134     251.0  Morning
77         45    110       141     300.0  Morning
78        120    100       130     500.4  Morning
79        270    100       131    1729.0  Morning
80         30    159       182     319.2  Morning
81         45    149       169     344.0  Morning
82         30    103       139     151.1  Morning
83        120    100       130     500.0  Morning
84         45    100       120     225.3  Morning
85         30    151       170     300.0  Morning
86         45    102       136     234.0  Morning
87        120    100       157    1000.1  Morning
88         45    129       103     242.0  Morning
89         20     83       107      50.3  Morning
90        180    101       127     600.1  Morning
91         45    107       137       NaN  Morning
92         30     90       107     105.3  Morning
93         15     80       100      50.5  Morning
94         20    150       171     127.4  Morning
95         20    151       168     229.4  Morning
96         30     95       128     128.2  Morning
97         25    152       168     244.2  Morning
98         30    109       131     188.2  Morning
99         90     93       124     604.1  Morning
100        20     95       112      77.7  Morning
101        90     90       110     500.0  Morning
102        90     90       100     500.0  Morning
103        90     90       100     500.4  Morning
104        30     92       108      92.7  Morning
105        30     93       128     124.0  Morning
106       180     90       120     800.3  Morning
107        30     90       120      86.2  Morning
108        90     90       120     500.3  Morning
109       210    137       184    1860.4  Morning
110        60    102       124     325.2  Morning
111        45    107       124     275.0  Morning
112        15    124       139     124.2  Morning
113        45    100       120     225.3  Morning
114        60    108       131     367.6  Morning
115        60    108       151     351.7  Morning
116        60    116       141     443.0  Morning
117        60     97       122     277.4  Morning
118        60    105       125       NaN  Morning
119        60    103       124     332.7  Morning
120        30    112       137     193.9  Morning
121        45    100       120     100.7  Morning
122        60    119       169     336.7  Morning
123        60    107       127     344.9  Morning
124        60    111       151     368.5  Morning
125        60     98       122     271.0  Morning
126        60     97       124     275.3  Morning
127        60    109       127     382.0  Morning
128        90     99       125     466.4  Morning
129        60    114       151     384.0  Morning
130        60    104       134     342.5  Morning
131        60    107       138     357.5  Morning
132        60    103       133     335.0  Morning
133        60    106       132     327.5  Morning
134        60    103       136     339.0  Morning
135        20    136       156     189.0  Morning
136        45    117       143     317.7  Morning
137        45    115       137     318.0  Morning
138        45    113       138     308.0  Morning
139        20    141       162     222.4  Morning
140        60    108       135     390.0  Morning
141        60     97       127       NaN  Morning
142        45    100       120     250.4  Morning
143        45    122       149     335.4  Morning
144        60    136       170     470.2  Morning
145        45    106       126     270.8  Morning
146        60    107       136     400.0  Morning
147        60    112       146     361.9  Morning
148        30    103       127     185.0  Morning
149        60    110       150     409.4  Morning
150        60    106       134     343.0  Morning
151        60    109       129     353.2  Morning
152        60    109       138     374.0  Morning
153        30    150       167     275.8  Morning
154        60    105       128     328.0  Morning
155        60    111       151     368.5  Morning
156        60     97       131     270.4  Morning
157        60    100       120     270.4  Morning
158        60    114       150     382.8  Morning
159        30     80       120     240.9  Morning
160        30     85       120     250.4  Morning
161        45     90       130     260.4  Morning
162        45     95       130     270.0  Morning
163        45    100       140     280.9  Morning
164        60    105       140     290.8  Morning
165        60    110       145     300.0  Morning
166        60    115       145     310.2  Morning
167        75    120       150     320.4  Morning
168        75    125       150     330.4  Morning

## 3.2. Read Excel

To read excel file we need to install a engine **openpyxl**. Without this we cannot read an excel file.

In [98]:
!pip install openpyxl

Requirement already satisfied: openpyxl in /home/waheedabbas/Environments/cenv/lib/python3.10/site-packages (3.0.10)
Requirement already satisfied: et-xmlfile in /home/waheedabbas/Environments/cenv/lib/python3.10/site-packages (from openpyxl) (1.1.0)

In [99]:
df = pd.read_excel('data.xlsx')

In [100]:
print(df)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

## 3.3. Read Json

Big data sets are often stored, or extracted as JSON.

JSON is plain text, but has the format of an object, and is well known in the world of programming, including Pandas.

In [101]:
df = pd.read_json('data.json')

print(df.to_string())

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
5          60    102       127     300.5
6          60    110       136     374.0
7          45    104       134     253.3
8          30    109       133     195.1
9          60     98       124     269.0
10         60    103       147     329.3
11         60    100       120     250.7
12         60    106       128     345.3
13         60    104       132     379.3
14         60     98       123     275.0
15         60     98       120     215.2
16         60    100       120     300.0
17         45     90       112       NaN
18         60    103       123     323.0
19         45     97       125     243.0
20         60    108       131     364.2
21         45    100       119     282.0
22         60    130       101     300.0
23         45    105       132     246.0
24         60    102       126     334.5
25         60    100       120     250.0
26         60     92       118     241.0
27         60    103       132       NaN
28         60    100       132     280.0
29         60    102       129     380.3
30         60     92       115     243.0
31         45     90       112     180.1
32         60    101       124     299.0
33         60     93       113     223.0
34         60    107       136     361.0
35         60    114       140     415.0
36         60    102       127     300.5
37         60    100       120     300.1
38         60    100       120     300.0
39         45    104       129     266.0
40         45     90       112     180.1
41         60     98       126     286.0
42         60    100       122     329.4
43         60    111       138     400.0
44         60    111       131     397.0
45         60     99       119     273.0
46         60    109       153     387.6
47         45    111       136     300.0
48         45    108       129     298.0
49         60    111       139     397.6
50         60    107       136     380.2
51         80    123       146     643.1
52         60    106       130     263.0
53         60    118       151     486.0
54         30    136       175     238.0
55         60    121       146     450.7
56         60    118       121     413.0
57         45    115       144     305.0
58         20    153       172     226.4
59         45    123       152     321.0
60        210    108       160    1376.0
61        160    110       137    1034.4
62        160    109       135     853.0
63         45    118       141     341.0
64         20    110       130     131.4
65        180     90       130     800.4
66        150    105       135     873.4
67        150    107       130     816.0
68         20    106       136     110.4
69        300    108       143    1500.2
70        150     97       129    1115.0
71         60    109       153     387.6
72         90    100       127     700.0
73        150     97       127     953.2
74         45    114       146     304.0
75         90     98       125     563.2
76         45    105       134     251.0
77         45    110       141     300.0
78        120    100       130     500.4
79        270    100       131    1729.0
80         30    159       182     319.2
81         45    149       169     344.0
82         30    103       139     151.1
83        120    100       130     500.0
84         45    100       120     225.3
85         30    151       170     300.1
86         45    102       136     234.0
87        120    100       157    1000.1
88         45    129       103     242.0
89         20     83       107      50.3
90        180    101       127     600.1
91         45    107       137       NaN
92         30     90       107     105.3
93         15     80       100      50.5
94         20    150       171     127.4
95         20    151       168     229.4
96         30     95       128     128.2
97         25    152       168     244.2
98         30    109       131     188.2
99         90     93       124     604.1
100        20     95       112      77.7
101        90     90       110     500.0
102        90     90       100     500.0
103        90     90       100     500.4
104        30     92       108      92.7
105        30     93       128     124.0
106       180     90       120     800.3
107        30     90       120      86.2
108        90     90       120     500.3
109       210    137       184    1860.4
110        60    102       124     325.2
111        45    107       124     275.0
112        15    124       139     124.2
113        45    100       120     225.3
114        60    108       131     367.6
115        60    108       151     351.7
116        60    116       141     443.0
117        60     97       122     277.4
118        60    105       125       NaN
119        60    103       124     332.7
120        30    112       137     193.9
121        45    100       120     100.7
122        60    119       169     336.7
123        60    107       127     344.9
124        60    111       151     368.5
125        60     98       122     271.0
126        60     97       124     275.3
127        60    109       127     382.0
128        90     99       125     466.4
129        60    114       151     384.0
130        60    104       134     342.5
131        60    107       138     357.5
132        60    103       133     335.0
133        60    106       132     327.5
134        60    103       136     339.0
135        20    136       156     189.0
136        45    117       143     317.7
137        45    115       137     318.0
138        45    113       138     308.0
139        20    141       162     222.4
140        60    108       135     390.0
141        60     97       127       NaN
142        45    100       120     250.4
143        45    122       149     335.4
144        60    136       170     470.2
145        45    106       126     270.8
146        60    107       136     400.0
147        60    112       146     361.9
148        30    103       127     185.0
149        60    110       150     409.4
150        60    106       134     343.0
151        60    109       129     353.2
152        60    109       138     374.0
153        30    150       167     275.8
154        60    105       128     328.0
155        60    111       151     368.5
156        60     97       131     270.4
157        60    100       120     270.4
158        60    114       150     382.8
159        30     80       120     240.9
160        30     85       120     250.4
161        45     90       130     260.4
162        45     95       130     270.0
163        45    100       140     280.9
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [102]:
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

---

# 4. Converting back to a CSV, JSON, or SQL

You can export a dataframe into many formats like CSV, JSON, Ecel or any other as per your requirement.

In [103]:
df.to_csv('converted.csv')
df.to_excel('converted.xlsx')
df.to_json('converted.json')

# 5. View Data

In [104]:
df = pd.read_csv('data.csv')

## 5.1. head()

See top 5 values by using **head()**

In [106]:
# By default it will show 5 from top
df.head()

   Duration  Pulse  Maxpulse  Calories     Time
0        60    110       130     409.1  Morning
1        60    117       145     479.0  Morning
2        60    103       135     340.0  Morning
3        45    109       175     282.4  Morning
4        45    117       148     406.0  Morning

In [107]:
# You can also mention any amount
df.head(10)

   Duration  Pulse  Maxpulse  Calories     Time
0        60    110       130     409.1  Morning
1        60    117       145     479.0  Morning
2        60    103       135     340.0  Morning
3        45    109       175     282.4  Morning
4        45    117       148     406.0  Morning
5        60    102       127     300.0  Morning
6        60    110       136     374.0  Evening
7        45    104       134     253.3  Morning
8        30    109       133     195.1  Morning
9        60     98       124     269.0  Morning

## 5.2. tail()

See bottom 5 values by using **tail()**

In [108]:
# By default it will show 5 from bottom
df.tail()

     Duration  Pulse  Maxpulse  Calories     Time
164        60    105       140     290.8  Morning
165        60    110       145     300.0  Morning
166        60    115       145     310.2  Morning
167        75    120       150     320.4  Morning
168        75    125       150     330.4  Morning

In [109]:
# You can also mention any amount
df.tail(10)

     Duration  Pulse  Maxpulse  Calories     Time
159        30     80       120     240.9  Morning
160        30     85       120     250.4  Morning
161        45     90       130     260.4  Morning
162        45     95       130     270.0  Morning
163        45    100       140     280.9  Morning
164        60    105       140     290.8  Morning
165        60    110       145     300.0  Morning
166        60    115       145     310.2  Morning
167        75    120       150     320.4  Morning
168        75    125       150     330.4  Morning

## 5.3. sample()

In [110]:
df.sample(frac=0.5)

     Duration  Pulse  Maxpulse  Calories     Time
73        150     97       127     953.2  Morning
92         30     90       107     105.3  Morning
94         20    150       171     127.4  Morning
14         60     98       123     275.0  Morning
164        60    105       140     290.8  Morning
..        ...    ...       ...       ...      ...
88         45    129       103     242.0  Morning
30         60     92       115     243.0  Morning
6          60    110       136     374.0  Evening
123        60    107       127     344.9  Morning
15         60     98       120     215.2  Morning

[84 rows x 5 columns]

---

# 6. Getting info about your data

## 6.1. info()

**.info()** should be one of the very first commands you run after loading your data:

In [112]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
 4   Time      169 non-null    object
dtypes: float64(1), int64(3), object(1)
memory usage: 6.7+ KB

**.info()** provides the essential details about your dataset, such as the number of rows and columns, the number of non-null values, what type of data is in each column, and how much memory your DataFrame is using.

## 6.2. describe()

Descriptive statistics include those that summarize the central tendency, dispersion and shape of a datasetâ€™s distribution, excluding NaN values.

In [114]:
df.describe()

         Duration       Pulse    Maxpulse     Calories
count  169.000000  169.000000  169.000000   164.000000
mean    63.846154  107.461538  134.047337   375.790244
std     42.299949   14.510259   16.450434   266.379919
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

## 6.3. shape

useful attribute is **.shape**, which outputs just a tuple of (rows, columns):

In [115]:
df.shape

(169, 5)

Note that .shape has no parentheses and is a simple tuple of format (rows, columns). So we have **169 rows and 4 columns** in our movies DataFrame.

## 6.4. isnull()

**isnull()** should return you True or False for each dataframe element based on whatever it is null or not

In [116]:
df.isnull()

     Duration  Pulse  Maxpulse  Calories   Time
0       False  False     False     False  False
1       False  False     False     False  False
2       False  False     False     False  False
3       False  False     False     False  False
4       False  False     False     False  False
..        ...    ...       ...       ...    ...
164     False  False     False     False  False
165     False  False     False     False  False
166     False  False     False     False  False
167     False  False     False     False  False
168     False  False     False     False  False

[169 rows x 5 columns]

In [117]:
# generate summary for each column
df.isnull().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    5
Time        0
dtype: int64

## 6.5. min, max, mean, median, mode, value_counts

We can perform different on column on a pandas DataFrame as following:

calculate min on entire df or indivual column.

In [118]:
df.min()

Duration         15
Pulse            80
Maxpulse        100
Calories       50.3
Time        Evening
dtype: object

In [119]:
df['Calories'].min()

50.3

calculate max on entire df or indivual column.

In [120]:
df.max()

Duration        300
Pulse           159
Maxpulse        184
Calories     1860.4
Time        Morning
dtype: object

In [121]:
df['Calories'].max()

1860.4

calculate mean on entire df or indivual column.

In [122]:
df.mean()

/tmp/ipykernel_13446/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Duration     63.846154
Pulse       107.461538
Maxpulse    134.047337
Calories    375.790244
dtype: float64

In [123]:
df['Calories'].mean()

375.79024390243904

calculate median on entire df or indivual column.

In [124]:
df.median()

/tmp/ipykernel_13446/530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

Duration     60.0
Pulse       105.0
Maxpulse    131.0
Calories    318.6
dtype: float64

In [125]:
df['Calories'].median()

318.6

calculate mode on entire df or indivual column.

In [126]:
df.mode()

   Duration  Pulse  Maxpulse  Calories     Time
0        60    100       120     300.0  Morning

In [127]:
df['Calories'].mode()

0    300.0
Name: Calories, dtype: float64

calculate counts of unique values on column.

In [135]:
df['Time'].unique()

array(['Morning', 'Evening'], dtype=object)

In [136]:
df['Time'].nunique()

2

In [139]:
df['Time'].value_counts()/len(df)*100

Morning    96.449704
Evening     3.550296
Name: Time, dtype: float64

In [142]:
round(df['Time'].value_counts()/len(df)*100, 2)

Morning    96.45
Evening     3.55
Name: Time, dtype: float64

# 7. Subsetting, Selecting and Filtering

In [143]:
df.columns

Index(['Duration', 'Pulse', 'Maxpulse', 'Calories', 'Time'], dtype='object')

We can select specific columns by specifying the name as below:

In [148]:
df[['Duration', 'Maxpulse']]

     Duration  Maxpulse
0          60       130
1          60       145
2          60       135
3          45       175
4          45       148
..        ...       ...
164        60       140
165        60       145
166        60       145
167        75       150
168        75       150

[169 rows x 2 columns]

In [150]:
df[['Duration', 'Maxpulse']].head(10)

   Duration  Maxpulse
0        60       130
1        60       145
2        60       135
3        45       175
4        45       148
5        60       127
6        60       136
7        45       134
8        30       133
9        60       124

In [151]:
df['Calories'].max()

1860.4

In [17]:
df[df['Maxpulse']>130]['Maxpulse'].mean()

145.64772727272728

In [29]:
df[~((df['Time']=='Evening') & (df['Pulse']>130))]

     Duration  Pulse  Maxpulse  Calories     Time
0          60    110       130     409.1  Morning
1          60    117       145     479.0  Morning
2          60    103       135     340.0  Morning
3          45    109       175     282.4  Morning
4          45    117       148     406.0  Morning
..        ...    ...       ...       ...      ...
164        60    105       140     290.8  Morning
165        60    110       145     300.0  Morning
166        60    115       145     310.2  Morning
167        75    120       150     320.4  Morning
168        75    125       150     330.4  Morning

[168 rows x 5 columns]

# 8. Data Aggregation using Group By, Pivot, and Melt

In [37]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

In [38]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

## 8.1. Split data into groups

In [39]:
gp = df.groupby('Team')

In [40]:
gp.first()

        Rank  Year  Points
Team
Devils     2  2014     863
Kings      3  2014     741
Riders     1  2014     876
Royals     4  2014     701

In [41]:
gp.groups

{'Devils': [2, 3], 'Kings': [4, 5, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10]}

In [42]:
gp = df.groupby(['Team','Year'])

In [43]:
gp.groups

{('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('Kings', 2015): [5], ('Kings', 2016): [6], ('Kings', 2017): [7], ('Riders', 2014): [0], ('Riders', 2015): [1], ('Riders', 2016): [8], ('Riders', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10]}

In [45]:
gp = df.groupby('Year')

for name, group in gp:
    print(name)
    print(group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    Kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [47]:
group

      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [48]:
gp = df.groupby('Year')
print(gp.get_group(2014))

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

## 8.2. Aggrigate

In [50]:
gp = df.groupby('Year')

In [56]:
gp.agg('mean')
#gp.mean() #alterative way

      Rank  Points
Year
2014   2.5  795.25
2015   2.5  769.50
2016   1.5  725.00
2017   1.5  739.00

In [53]:
gp.mean()

      Rank  Points
Year
2014   2.5  795.25
2015   2.5  769.50
2016   1.5  725.00
2017   1.5  739.00

In [82]:
gp.agg('count')

      Team  Rank  Points
Year
2014     4     4       4
2015     4     4       4
2016     2     2       2
2017     2     2       2

In [83]:
gp.agg('min')

        Team  Rank  Points
Year
2014  Devils     1     701
2015  Devils     1     673
2016   Kings     1     694
2017   Kings     1     690

In [84]:
gp.agg('max')

        Team  Rank  Points
Year
2014  Royals     4     876
2015   kings     4     812
2016  Riders     2     756
2017  Riders     2     788

In [57]:
gp.agg(['sum', 'mean', 'max'])

/tmp/ipykernel_7949/872016671.py:1: FutureWarning: ['Team'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  gp.agg(['sum', 'mean', 'max'])

     Rank          Points
      sum mean max    sum    mean  max
Year
2014   10  2.5   4   3181  795.25  876
2015   10  2.5   4   3078  769.50  812
2016    3  1.5   2   1450  725.00  756
2017    3  1.5   2   1478  739.00  788

In [85]:
gp['Points'].agg(['sum', 'mean', 'max'])

       sum    mean  max
Year
2014  3181  795.25  876
2015  3078  769.50  812
2016  1450  725.00  756
2017  1478  739.00  788

In [58]:
gp = df.groupby(['Team', 'Year'])

In [60]:
gp.mean()

             Rank  Points
Team   Year
Devils 2014   2.0   863.0
       2015   3.0   673.0
Kings  2014   3.0   741.0
       2015   4.0   812.0
       2016   1.0   756.0
       2017   1.0   788.0
Riders 2014   1.0   876.0
       2015   2.0   789.0
       2016   2.0   694.0
       2017   2.0   690.0
Royals 2014   4.0   701.0
       2015   1.0   804.0

## 8.3. Transform

Transformation on a group or a column returns an object that is indexed the same size of that is being grouped. Thus, the transform should return a result that is the same size as that of a group chunk.

In [66]:
gp = df.groupby('Team')
#score = lambda x: (x - x.mean()) / x.std()*10

In [67]:
def score(x):
    return (x-x.mean())/x.std()*10

In [69]:
gp.transform(score)

         Rank       Year     Points
0  -15.000000 -11.618950  12.843272
1    5.000000  -3.872983   3.020286
2   -7.071068  -7.071068   7.071068
3    7.071068   7.071068  -7.071068
4    5.000000 -11.618950 -10.423334
5   11.666667  -3.872983  11.834011
6   -8.333333   3.872983  -5.721078
7   -8.333333  11.618950   4.310401
8    5.000000   3.872983  -7.705963
9    7.071068  -7.071068  -7.071068
10  -7.071068   7.071068   7.071068
11   5.000000  11.618950  -8.157595

## 8.4. Filtration

Filtration filters the data on a defined criteria and returns the subset of data. The filter() function is used to filter the data.

In [71]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [72]:
df.groupby('Team').filter(lambda x: len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [73]:
df['Team'].value_counts()

Riders    4
Kings     4
Devils    2
Royals    2
Name: Team, dtype: int64

# 9. Pivot

The **pivot()** function is used to reshaped a given DataFrame organized by given index / column values. This function does not support data aggregation, multiple values will result in a MultiIndex in the columns.

A pivot table is a table of statistics that summarizes the data of a more extensive table.

**pandas.pivot(index, columns, values)** function produces pivot table based on 3 columns of the DataFrame. Uses unique values from index / columns and fills with values.

In [102]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [74]:
df.pivot('Team', 'Year', 'Points')

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0  812.0  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN

In [80]:
df.pivot(index='Rank', columns='Year', values=['Points','Team'])

     Points                   Team
Year   2014 2015 2016 2017    2014    2015    2016    2017
Rank
1       876  804  756  788  Riders  Royals   Kings   Kings
2       863  789  694  690  Devils  Riders  Riders  Riders
3       741  673  NaN  NaN   Kings  Devils     NaN     NaN
4       701  812  NaN  NaN  Royals   Kings     NaN     NaN

In [81]:
# here what is happening under the hood
print(df.groupby(['Rank', 'Year']).Points.sum())
df.groupby(['Rank', 'Year']).Points.sum().unstack()

Rank  Year
1     2014    876
      2015    804
      2016    756
      2017    788
2     2014    863
      2015    789
      2016    694
      2017    690
3     2014    741
      2015    673
4     2014    701
      2015    812
Name: Points, dtype: int64

Year   2014   2015   2016   2017
Rank
1     876.0  804.0  756.0  788.0
2     863.0  789.0  694.0  690.0
3     741.0  673.0    NaN    NaN
4     701.0  812.0    NaN    NaN

# 10. Melt

To make analysis of data in table easier, we can reshape the data into a more computer-friendly form using Pandas in Python. Pandas.melt() is one of the function to do so..
Pandas.melt() unpivots a DataFrame from wide format to long format.
**melt()** function is useful to message a DataFrame into a format where one or more columns are identifier variables, while all other columns, considered measured variables, are unpivoted to the row axis, leaving just two non-identifier columns, variable and value.

In [82]:
# creating a dataframe
df = pd.DataFrame({'Name': {0: 'John', 1: 'Bob', 2: 'Shiela'},
                   'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'},
                   'Age': {0: 27, 1: 23, 2: 21}})
df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

In [83]:
df.melt('Name')

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate
3    John      Age        27
4     Bob      Age        23
5  Shiela      Age        21

In [84]:
df.melt('Name', 'Age')

     Name variable  value
0    John      Age     27
1     Bob      Age     23
2  Shiela      Age     21

In [137]:
pd.melt(df, id_vars=['Name'], value_vars=['Course'])

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate

In [85]:
# Names of â€˜variableâ€™ and â€˜valueâ€™ columns can be customized
pd.melt(df, id_vars =['Name'], value_vars =['Course'],
              var_name ='ChangedVarname', value_name ='ChangedValname')

     Name ChangedVarname ChangedValname
0    John         Course        Masters
1     Bob         Course       Graduate
2  Shiela         Course       Graduate

In [2]:
list_ = ["Red","Green","White" ,"Black"]

In [3]:
list_[::3]

['Red', 'Black']